#ifndef BP_FILE_H
#define BP_FILE_H
#include <record.h>
#include <stdbool.h>

// Ορισμός μεταδεδομένων για το B+-δέντρο
typedef struct {
    int root_block;                // Δείκτης στη ρίζα του δέντρου
    int height;                    // Ύψος του δέντρου
    int num_blocks;                // Συνολικός αριθμός μπλοκ (δεδομένων + ευρετηρίου)
    int data_block_start;          // Δείκτης στο πρώτο μπλοκ δεδομένων
    int index_block_start;         // Δείκτης στο πρώτο μπλοκ ευρετηρίου
    int block_type;                // 0: Data Block, 1: Index Block
    int record_size;               // Μέγεθος κάθε εγγραφής (σε bytes)
    int num_records_per_block;     // Πλήθος εγγραφών ανά μπλοκ δεδομένων
    int num_keys_per_index_block;  // Πλήθος κλειδιών ανά μπλοκ ευρετηρίου
    bool is_bplus_file;            // Σήμανση αν το αρχείο είναι B+-δέντρο
    int max_open_files;            // Μέγιστος αριθμός ανοικτών αρχείων
    int max_buffer_size;           // Μέγιστος αριθμός μπλοκ στη μνήμη
} BPLUS_INFO;

typedef enum Bplus_ErrorCode {
    bplus_OK = 0,
    bplus_ERROR = 1
} Bplus_ErrorCode;


/** BP_CreateFile: Αυτή η συνάρτηση χρησιμοποιείται για τη δημιουργία και 
 * αρχικοποίηση ενός κενού αρχείου B+ δέντρου με το όνομα fileName. Κατά 
 * τη δημιουργία του αρχείου, προστίθενται επίσης τα μεταδεδομένα BP_info 
 * στο πρώτο μπλοκ του αρχείου. Εάν η λειτουργία είναι επιτυχής, επιστρέφει 
 * 0, αλλιώς επιστρέφει -1.**/
int BP_CreateFile(char *fileName);

/** BP_OpenFile: Αυτή η συνάρτηση ανοίγει το αρχείο B+ δέντρου με το όνομα 
 * fileName και ανακτά τα μεταδεδομένα του. Η BP_info είναι η δομή που 
 * επιστρέφεται και περιέχει τα μεταδεδομένα του B+ δέντρου. Η παράμετρος 
 * *file_desc είναι ο αναγνωριστικός αριθμός αρχείου που λαμβάνεται από το 
 * BF_OpenFile.**/
BPLUS_INFO* BP_OpenFile(char *fileName, int *file_desc);

/** BP_CloseFile: Αυτή η συνάρτηση κλείνει το αρχείο B+ δέντρου που 
 * αναγνωρίζεται από το file_desc. Εάν είναι επιτυχής, επιστρέφει 0, 
 * διαφορετικά επιστρέφει -1. Σε περίπτωση επιτυχούς κλεισίματος, 
 * απελευθερώνει επίσης τη μνήμη που καταλαμβάνει η δομή BP_info, η οποία 
 * αποθηκεύει τη μορφή του B+ δέντρου στη μνήμη.**/
int BP_CloseFile(int file_desc,BPLUS_INFO* info);

/** BP_InsertEntry: Αυτή η συνάρτηση εισάγει μία νέα εγγραφή στη δομή του 
 * B+ δέντρου. Το αρχείο αναγνωρίζεται από το file_desc, τα μεταδεδομένα 
 * του B+ δέντρου βρίσκονται στο BP_info, και η εγγραφή που θα εισαχθεί 
 * ορίζεται από τη δομή Record. Η συνάρτηση εντοπίζει τον κατάλληλο κόμβο 
 * δεδομένων για το κλειδί της εγγραφής και την εισάγει, κάνοντας τις 
 * απαραίτητες αλλαγές για να διατηρηθεί η ισορροπία του δέντρου. Εάν η 
 * εισαγωγή είναι επιτυχής, επιστρέφει το blockId όπου εισήχθη η εγγραφή, 
 * διαφορετικά επιστρέφει -1.**/
int BP_InsertEntry(int file_desc,BPLUS_INFO* bplus_info, Record record);

/** BP_GetEntry: Αυτή η συνάρτηση αναζητά μια εγγραφή σε ένα B+ δέντρο με 
 * κλειδί που ταιριάζει με το συγκεκριμένο `id`. Ξεκινώντας από τη ρίζα, 
 * διασχίζει το B+ δέντρο για να εντοπίσει το σχετικό φύλλο όπου θα ήταν 
 * αποθηκευμένο το κλειδί. Αν βρεθεί μια ταιριαστή εγγραφή, η συνάρτηση 
 * θέτει το `result` να δείχνει στην εγγραφή αυτή και επιστρέφει `0` για 
 * να υποδείξει επιτυχία. Αν δεν υπάρχει τέτοια εγγραφή, η συνάρτηση θέτει 
 * το `result` σε `nullptr` και επιστρέφει `-1` για να υποδείξει αποτυχία.**/
int BP_GetEntry(int file_desc, BPLUS_INFO* header_info, int id, Record** result);




#endif 
